from sqlalchemy import create_engine, text

database_name = 'scooters'
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

connection_string

engine = create_engine(connection_string)

engine

#Initial EDA
query = '''
SELECT *
FROM scooters
LIMIT 10;
'''

with engine.connect() as connection:
    result = connection.execute(text(query))

result.fetchall()

In [1]:
import pandas as pd

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bird';
'''

with engine.connect() as connection:
    bird = pd.read_sql(text(query), con = connection)

bird.head()

bird.to_csv("birddf.csv", index = False)

In [2]:
#read in bird
birddf = pd.read_csv('../data/birddf.csv')

In [3]:
birddf.shape

(12251590, 9)

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Bolt';
'''

with engine.connect() as connection:
    bolt = pd.read_sql(text(query), con = connection)

bolt.head()

bolt.to_csv("boltdf.csv", index = False)

In [4]:
#Read in bolt
boltdf = pd.read_csv('../data/boltdf.csv')

In [5]:
boltdf.shape

(3477198, 9)

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Gotcha';
'''

with engine.connect() as connection:
    gotcha = pd.read_sql(text(query), con = connection)

gotcha.head()

gotcha.to_csv("gotchadf.csv", index = False)

In [6]:
#Read in gotcha
gotchadf = pd.read_csv('../data/gotchadf.csv')

In [7]:
gotchadf.shape

(4679280, 9)

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Jump';
'''

with engine.connect() as connection:
    jump = pd.read_sql(text(query), con = connection)

jump.head()

#Saving jump to csv

jump.to_csv("jumpdf.csv", index = False)

In [8]:
#Read in jump
jumpdf = pd.read_csv('../data/jumpdf.csv')

In [9]:
jumpdf.shape

(21835098, 9)

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Lime';
'''

with engine.connect() as connection:
    lime = pd.read_sql(text(query), con = connection)

lime.head()

lime.to_csv("limedf.csv", index = False)

In [10]:
limedf = pd.read_csv('../data/limedf.csv')

In [11]:
limedf.shape

(16524261, 9)

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Lyft';
'''

with engine.connect() as connection:
    lyft = pd.read_sql(text(query), con = connection)

lyft.head()

lyft.to_csv("lyftdf.csv", index = False)

In [12]:
lyftdf = pd.read_csv('../data/lyftdf.csv')

In [13]:
lyftdf.shape

(9087043, 9)

query = '''
SELECT *
FROM scooters
WHERE companyname = 'Spin';
'''

with engine.connect() as connection:
    spin = pd.read_sql(text(query), con = connection)

spin.head()

spin.to_csv("spindf.csv", index = False)

In [14]:
spindf = pd.read_csv('../data/spindf.csv')

In [15]:
spindf.shape

(5559573, 9)

query = '''
SELECT *
FROM trips;
'''

with engine.connect() as connection:
    tripsdf = pd.read_sql(text(query), con = connection)

tripsdf.head()

tripsdf.to_csv("tripsdf.csv", index = False)

query = '''
SELECT *
FROM trips;
'''

with engine.connect() as connection:
    trips = pd.read_sql(text(query), con = connection)

trips.head()

In [16]:
tripsdf = pd.read_csv('../data/tripsdf.csv')

In [17]:
tripsdf.shape

(565522, 16)

In [18]:
tripsdf.info

<bound method DataFrame.info of                    pubtimestamp companyname triprecordnum  \
0       2019-05-01 00:00:55.423        Bird       BRD2134
1       2019-05-01 00:03:33.147        Lyft          LFT5
2       2019-05-01 00:05:55.570        Bird       BRD2168
3       2019-05-01 00:05:55.570        Bird       BRD2166
4       2019-05-01 00:05:55.570        Bird       BRD2165
...                         ...         ...           ...
565517  2019-08-01 04:53:48.000        JUMP          JMP3
565518  2019-08-01 04:53:48.000        JUMP          JMP2
565519  2019-08-01 04:53:48.000        JUMP          JMP1
565520  2019-08-01 07:04:00.000        JUMP         JMP35
565521  2019-08-01 07:04:00.000        JUMP         JMP34

                                             sumdid  tripduration  \
0                                      Powered9EAJL      3.000000
1                                     Powered296631      1.715600
2                                      Powered7S2UU      3.000000
3                                      PoweredZIIVX      3.000000
4                                      PoweredJ7MB3      2.000000
...                                             ...           ...
565517  Powered5614e4fc-1971-5e5c-a545-0fd88cd3331d     17.497950
565518  Powereda4712099-5e55-5332-996c-d6e5c910535d      3.154917
565519  Poweredb8a3a269-d1ca-571f-9b2f-89b7399b5537     18.440650
565520  Poweredf077a919-d569-5e70-8ca7-71d179ffacf9    142.345610
565521  Powered784fcc92-bd1a-5f6a-8314-b02aa21b4bfa    209.409650

        tripdistance   startdate        starttime     enddate  \
0          958.00528  2019-05-01  00:00:20.460000  2019-05-01
1         1371.39112  2019-05-01  00:01:50.090000  2019-05-01
2         2296.58800  2019-05-01  00:03:47.363333  2019-05-01
3         1200.78744  2019-05-01  00:04:21.386666  2019-05-01
4          351.04988  2019-05-01  00:04:27.796666  2019-05-01
...              ...         ...              ...         ...
565517    7075.20000  2019-07-31         23:47:43  2019-08-01
565518    1320.00000  2019-07-31         23:57:19  2019-08-01
565519    7920.00000  2019-07-31         23:41:52  2019-08-01
565520   20433.60000  2019-07-31         23:26:15  2019-08-01
565521   14889.60000  2019-07-31         22:19:08  2019-08-01

                endtime  startlatitude  startlongitude  endlatitude  \
0       00:02:52.346666      36.157100      -86.803600    36.156600
1       00:03:33.026666      36.157970      -86.778960    36.160540
2       00:07:13.596666      36.154700      -86.781800    36.156500
3       00:06:59.176666      36.149400      -86.779500    36.153100
4       00:06:23.150000      36.177800      -86.786600    36.177400
...                 ...            ...             ...          ...
565517         00:05:13      36.154633      -86.798340    36.149220
565518         00:00:28      36.153015      -86.783585    36.152843
565519         00:00:18      36.153687      -86.784580    36.164158
565520         01:48:35      36.155735      -86.775185    36.173904
565521         01:48:33      36.160050      -86.776720    36.163410

        endlongitude                                          triproute  \
0         -86.806700  [(36.157235, -86.803612), (36.157235, -86.8036...
1         -86.776890  [(36.15797, -86.77896), (36.15795, -86.77873),...
2         -86.786800  [(36.155068, -86.782124), (36.156597, -86.78675)]
3         -86.779600  [(36.149741, -86.779344), (36.149741, -86.7793...
4         -86.787600  [(36.177699, -86.786477), (36.177711, -86.7864...
...              ...                                                ...
565517    -86.813980  [('36.154631', '-86.798341'), ('36.154631', '-...
565518    -86.779594  [('36.153016', '-86.783586'), ('36.153016', '-...
565519    -86.776900  [('36.153685', '-86.784578'), ('36.153685', '-...
565520    -86.785450  [('36.155736', '-86.775181'), ('36.155531', '-...
565521    -86.782100  [('36.160051', '-86.77672'), ('36.160051', '-8...

                      create_dt
0       2019-05-02 05:30:23.780
1       2019-05-02 07:20:32.757
2       2019-05-02 05:30:24.530
3       2019-05-02 05:30:24.237
4       2019-05-02 05:30:24.207
...                         ...
565517  2019-08-02 08:21:27.127
565518  2019-08-02 08:21:26.773
565519  2019-08-02 08:21:26.803
565520  2019-08-02 08:24:21.967
565521  2019-08-02 08:24:22.000

[565522 rows x 16 columns]>

In [20]:
#Concat to create the scooters table
scooters_list = [birddf, boltdf, gotchadf, jumpdf, limedf, lyftdf, spindf]
scootersdf = pd.concat(scooters_list)

In [21]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [22]:
scootersdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 5.5+ GB

## - Are there any null values in any columns in either table?

In [23]:
#Checking for NaN values in the scooters dataframe
scootersdf.isna().any()

pubdatetime    False
latitude       False
longitude      False
sumdid         False
sumdtype       False
chargelevel     True
sumdgroup      False
costpermin     False
companyname    False
dtype: bool

In [24]:
scootersdf.isnull().sum().sum()

770

In [25]:
#Checking for NaN values in the trips dataframe
tripsdf.isna().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

## - What date range is represented in each of the date columns? Investigate any values that seem odd.

In [26]:
scootersdf['pubdatetime'] = pd.to_datetime(scootersdf['pubdatetime'], dayfirst = False, format = 'mixed')

In [27]:
scootersdf.dtypes

pubdatetime    datetime64[ns]
latitude              float64
longitude             float64
sumdid                 object
sumdtype               object
chargelevel           float64
sumdgroup              object
costpermin            float64
companyname            object
dtype: object

In [28]:
scootersdf['pubdatetime'].max()

Timestamp('2019-07-31 23:59:57')

In [29]:
scootersdf['pubdatetime'].min()

Timestamp('2019-05-01 00:01:41.247000')

In [30]:
tripsdf['pubtimestamp'] = pd.to_datetime(tripsdf['pubtimestamp'], dayfirst = False, format = 'mixed')

In [31]:
tripsdf.dtypes

pubtimestamp      datetime64[ns]
companyname               object
triprecordnum             object
sumdid                    object
tripduration             float64
tripdistance             float64
startdate                 object
starttime                 object
enddate                   object
endtime                   object
startlatitude            float64
startlongitude           float64
endlatitude              float64
endlongitude             float64
triproute                 object
create_dt                 object
dtype: object

#Checking out the pubtimestamp column of the trips table
tripsdf["pubtimestamp"]

#Checking out the create_dt column in the trips df
tripsdf["create_dt"]

In [32]:
tripsdf['pubtimestamp'].min()

Timestamp('2019-05-01 00:00:55.423000')

In [33]:
tripsdf['pubtimestamp'].max()

Timestamp('2019-08-01 07:04:00')

The scooters df date range is '2019-05-01 00:01:41.247000' - '2019-07-31 23:59:57'.
The trips df date range is '2019-05-01 00:00:55.423000' - '2019-08-01 07:04:00'

## - Is time represented with am/pm or using 24 hour values in each of the columns that include time?

Time is represented in 24 hour values in the time columns in both dataframes.

## - What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [34]:
scootersdf.sumdgroup.unique()

array(['scooter', 'Scooter', 'bicycle'], dtype=object)

We don't need the bicycle sumdgroup for this project.

## - What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?

In [35]:
scootersdf['latitude'].min()

0.0

In [36]:
scootersdf['latitude'].max()

3609874.116666

In [37]:
scootersdf['longitude'].min()

-97.443879

In [38]:
scootersdf['longitude'].max()

0.0

In [39]:
tripsdf['startlatitude'].min()

35.8532

In [40]:
tripsdf['startlatitude'].max()

36.300029

In [41]:
tripsdf['startlongitude'].min()

-86.918008

In [42]:
tripsdf['startlongitude'].max()

-86.3662

The minimum latitude shown is "0.0", as well as the maximum longitude, which is surprising. The maximum latitude is '3609874.116666' which is also "surprising" to say the least.

## -What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [43]:
tripsdf['tripduration'].min()

-19.3582666667

In [44]:
tripsdf['tripduration'].max()

512619.0

In [45]:
tripsdf['tripdistance'].min()

-20324803.8

In [47]:
tripsdf['tripdistance'].max()

31884482.6476

In [46]:
tripsdf.query('`tripduration`== -19.3582666667')

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
509599,2019-07-19 00:14:02.297,Lyft,LFT21,Powered853770,-19.358267,4540.68256,2019-07-19,00:09:04.506666,2019-07-18,23:49:43.013333,36.15505,-86.78482,36.1469,-86.79355,"[(36.15505, -86.78482), (36.15511, -86.78482),...",2019-07-20 10:52:39.737

In [48]:
tripsdf.query('`tripdistance`== -20324803.8')

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
550038,2019-07-27 23:56:41.940,Bird,BRD5324,PoweredYZL2A,44.0,-20324803.8,2019-07-27,23:14:23.683333,2019-07-27,23:58:23.820000,36.1585,-86.7683,36.126,-86.7892,"[(36.158517, -86.768224), (36.158624, -86.7682...",2019-07-28 05:32:05.610

In [49]:
tripsdf.query('`tripdistance`== 31884482.6476')

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
447799,2019-07-05 01:18:52,Gotcha,GOT9,Powered2460,9.0,3.188448e+07,2019-07-05,01:18:56,2019-07-05,01:27:56,36.16338,-86.780142,36.16628,-86.778127,"[('0', '0'), ('36.16628', '-86.77813')]",2019-07-06 07:13:12.210

## - Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [50]:
scootersdf.companyname.unique()

array(['Bird', 'Bolt', 'Gotcha', 'Jump', 'Lime', 'Lyft', 'Spin'],
      dtype=object)

In [51]:
tripsdf.companyname.unique()

array(['Bird', 'Lyft', 'Lime', 'Bolt Mobility', 'SPIN', 'Gotcha', 'JUMP'],
      dtype=object)

In the trips df, "Bolt" is "Bolt Mobility", "Jump", and "Spin" are also in upper case.

## 1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [52]:
scootersdf.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [53]:
scootersdf['Month'] = scootersdf['pubdatetime'].dt.month

In [54]:
scooters_may = scootersdf[scootersdf['Month'] == 5]

In [55]:
scooters_may.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname,Month
145127,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird,5
145128,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird,5
145129,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird,5
145130,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird,5
145131,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird,5

In [65]:
may_company_scooters = scooters_may[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'maycount')\
                                                        .sort_values(['maycount'])

In [66]:
may_company_scooters

  companyname  maycount
2      Gotcha       223
1        Bolt       346
6        Spin       687
3        Jump       976
5        Lyft      1376
4        Lime      1632
0        Bird      3064

In [58]:
scooters_june = scootersdf[scootersdf['Month'] == 6]

In [67]:
june_company_scooters = scooters_june[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'junecount')\
                                                        .sort_values(['junecount'])

In [68]:
june_company_scooters

  companyname  junecount
2      Gotcha        223
1        Bolt        333
6        Spin        713
3        Jump       1036
5        Lyft       1152
4        Lime       1461
0        Bird       2910

In [61]:
scooters_july = scootersdf[scootersdf['Month'] == 7]

In [69]:
july_company_scooters = scooters_july[['companyname', 'sumdid']].groupby(['companyname'])['sumdid']\
                                                        .nunique()\
                                                        .reset_index(name = 'julycount')\
                                                        .sort_values(['julycount'])

In [70]:
july_company_scooters

  companyname  julycount
2      Gotcha        224
1        Bolt        276
6        Spin        570
4        Lime        903
5        Lyft       1026
3        Jump       1206
0        Bird       2583

In [73]:
may_june = may_company_scooters.merge(june_company_scooters, how = 'inner', on = 'companyname')

In [75]:
company_scooters_months = may_june.merge(july_company_scooters, how = 'inner', on = 'companyname')

In [76]:
company_scooters_months

  companyname  maycount  junecount  julycount
0      Gotcha       223        223        224
1        Bolt       346        333        276
2        Spin       687        713        570
3        Jump       976       1036       1206
4        Lyft      1376       1152       1026
5        Lime      1632       1461        903
6        Bird      3064       2910       2583

In [79]:
tripsdf

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.000000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.157100,-86.803600,36.156600,-86.806700,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.715600,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.157970,-86.778960,36.160540,-86.776890,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.000000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.154700,-86.781800,36.156500,-86.786800,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.000000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.149400,-86.779500,36.153100,-86.779600,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.000000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.177800,-86.786600,36.177400,-86.787600,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
565517,2019-08-01 04:53:48.000,JUMP,JMP3,Powered5614e4fc-1971-5e5c-a545-0fd88cd3331d,17.497950,7075.20000,2019-07-31,23:47:43,2019-08-01,00:05:13,36.154633,-86.798340,36.149220,-86.813980,"[('36.154631', '-86.798341'), ('36.154631', '-...",2019-08-02 08:21:27.127
565518,2019-08-01 04:53:48.000,JUMP,JMP2,Powereda4712099-5e55-5332-996c-d6e5c910535d,3.154917,1320.00000,2019-07-31,23:57:19,2019-08-01,00:00:28,36.153015,-86.783585,36.152843,-86.779594,"[('36.153016', '-86.783586'), ('36.153016', '-...",2019-08-02 08:21:26.773
565519,2019-08-01 04:53:48.000,JUMP,JMP1,Poweredb8a3a269-d1ca-571f-9b2f-89b7399b5537,18.440650,7920.00000,2019-07-31,23:41:52,2019-08-01,00:00:18,36.153687,-86.784580,36.164158,-86.776900,"[('36.153685', '-86.784578'), ('36.153685', '-...",2019-08-02 08:21:26.803
565520,2019-08-01 07:04:00.000,JUMP,JMP35,Poweredf077a919-d569-5e70-8ca7-71d179ffacf9,142.345610,20433.60000,2019-07-31,23:26:15,2019-08-01,01:48:35,36.155735,-86.775185,36.173904,-86.785450,"[('36.155736', '-86.775181'), ('36.155531', '-...",2019-08-02 08:24:21.967
565521,2019-08-01 07:04:00.000,JUMP,JMP34,Powered784fcc92-bd1a-5f6a-8314-b02aa21b4bfa,209.409650,14889.60000,2019-07-31,22:19:08,2019-08-01,01:48:33,36.160050,-86.776720,36.163410,-86.782100,"[('36.160051', '-86.77672'), ('36.160051', '-8...",2019-08-02 08:24:22.000